{                
  "1": {                
    "Begining": {                
      "Played": false,      
      "Speaker": [                
        {                
          "Position": "left",                
          "Speak": [ 0, 2, 4, 6, 8, 10 ],                
          "Character": "Tobi"                
        },                
        {                
          "Position": "right",                
          "Speak": [ 1, 3, 5, 7, 9 ],                
          "Character": "Sifu"                
        }                
      ],                
      "Sentences": [                
        "Sifu-Sensei !",                
        "Tobi-Uchi-deshi, you are here.",                
        "You called for me, sensei?",                
        "Today Tobi-Uchi-deshi, your apprenticeship ends. I will teach you the secret technique of our ninja school: \n The lightning step !",                
        "Osu !",                
        "First, you need to touch the circle on the left side of the screen to choose a direction. \n Then touch the jump button on the right to propel yourself.\n the lightning step is so fast you won't stop until you hit a wall!",                
        "Osu !",                
        "Remember, first the left to select a direction then the jump to mave forward.",                
        "Osu !",                
        "If you are that confident try it on this guard. Jumping toward one of them will take care of him. \n But be careful, if he sees you, you will have to restart.",                
        "I will be careful, Sensei."                
      ]                
    },                
    "End": {                
      "Played": false,     
      "Speaker": [                
        {                
          "Position": "left",                
          "Speak": [ 1 ],                
          "Character": "Tobi"                
        },                
        {                
          "Position": "right",                
          "Speak": [ 0, 2 ],                
          "Character": "Sifu"                
        }                
      ],                
      "Sentences": [                
        "Well Done, Tobi !",                
        "Thank you, Sensei.",                
        "Let us move on to the next test."                
      ]                
    }                
  },                
  "2": {                
    "Begining": {                
      "Played": false,  
      "Speaker": [                
        {                
          "Position": "left",                
          "Speak": [ 1, 3 ],                
          "Character": "Tobi"                
        },                
        {                
          "Position": "right",                
          "Speak": [ 0, 2 ],                
          "Character": "Sifu"                
        }                
      ],                
      "Sentences": [                
        "Let's complicated things a bit... \n Guards won't always stand like witout moving. Some will look around, some will walk and some other will do both!",                
        "Osu !",                
        "Now take care of this one Tobi-Uchi-deshi.",                
        "Osu, Sifu-Sensei !"                
      ]                
    },                
    "End": {                
      "Played": false, 
      "Speaker": [                
        {                
          "Position": "left",                
          "Speak": [ 1, 3 ],                
          "Character": "Tobi"                
        },                
        {                
          "Position": "right",                
          "Speak": [ 0, 2 ],                
          "Character": "Sifu"                
        }                
      ],                
      "Sentences": [                
        "Hmmmm . . .",                
        "Sensei ?",                
        "What ? Oh Yes well only one test left young Tobi... Uchi-deshi.",                
        "Osu !"                
      ]                
    }                
  },                
  "3": {                
    "Begining": {                
      "Played": false,                
      "Speaker": [                
        {                
          "Position": "left",                
          "Speak": [ 1, 3 ],                
          "Character": "Tobi"                
        },                
        {                
          "Position": "right",                
          "Speak": [ 0, 2, 4 ],                
          "Character": "Sifu"                
        }                
      ],                
      "Sentences": [                
        "There is one last thing you need to remember...",                
        "Osu !",                
        "We are the sword of the Shogun. \n We do not kill inocent and we go unseen.",                
        "I will as swift as the wind and as silent as the night, Sensei.",                
        "Well, training makes perfect. \n Show me"                
      ]                
    },                
    "End": {                
      "Played": false,                
      "Speaker": [                
        {                
          "Position": "left",                
          "Speak": [ 0, 2, 4, 6, 9, 15, 18 ],                
          "Character": "Tobi"                
        },                
        {                
          "Position": "right",                
          "Speak": [ 1, 3, 5, 7, 8, 10, 11, 12, 13, 14, 16, 17 ],                
          "Character": "Sifu"                
        }                
      ],                
      "Sentences": [                
        "It is done, Sensei.",                
        "And with this, I am your sensei no longer...",                
        "But...",                
        "Enough Tobi-kun, It is so.",                
        "...",                
        "Here, Tobi-kun, a shinobi record ( aka Menu de selction de niveau ), it will be usefull on your journey if you wish to go back to an already visited place.",                
        "Aligato Sifu-Sen... Sifu-Sama.",                
        "Now you are a fully fledged graduate, a true shinobi of the Lightning school. \n Be prood, few deserved this much honor.",                
        "But with this honor comes great responsability. \n A mission has arrived, Enmaru Tobi will the first seat of the Lightning shinobis answer the call ?",                
        "Osu, Enmaru Tobi first seat of the Lightning shinobis answer the call !",                
        "Good. \n Oda-dono, the great shogun, has sent for our services.",                
        "Seven Daimios have betrayed our ranks and plot to overthrow the merciful ruler of our lands. \n They refused the olive branch he presented and spit on their mercy.",                
        "You are to bring to them the shogun justice.  \n Until you did so and tied up any loose end ther may be, you will not return to this place as to protect it from those who will seek vengeance upon us.",                
        "But beware, Dark forces are at work here. The Daimios would never rise up unless someone or something back them up.",                
        "Trust no one you do not already know and doubt everyone you do.",                
        "Osu, i will leave right away !",                
        "I hope you come back alive, but death is better than failure. For failure will mark this place doom and the death of all your kouhai and senpai.",                
        "For Oda-dono forgiveness is so.",                
        "Osu !"                
      ]                
    }                
  }                
}